W4D4-master/music_app/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        @bands = Band.all

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @band = Band.find(params[:id])

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Walk The Moon"], ["created_at", "2019-05-02 20:20:08.389557"], ["updated_at", "2019-05-02 20:20:08.389557"]]
---
    def create
        @band = Band.new(band_params)

        if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Coldplay!"], ["updated_at", "2019-05-02 20:27:02.303183"], ["id", 1]]
---
    def update
        @band = Band.find(params[:id])

        if @band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]
---
    def destroy
        @band = Band.find(params[:id])
        @band.destroy