W4D4-master/music_app/app/models/user.rb

    def reset_session_token!
        self.update!(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "3AhoMfLxAV05fLoGhCzuTQ"], ["updated_at", "2019-05-02 15:21:15.346027"], ["id", 2]]